export type StorySegment = {
  id: number;
  title : string;
  sentences: { sentence: string }[];
  image: string;
};

export const story: StorySegment[] = [
  {
    id: 1,
    title : 'မောင်မြတ်သူ၏ ပန်းချီပြိုင်ပွဲ',
    sentences: [
      {
        sentence:
          "တစ်ခါတုန်းက မောင်မြတ်သူဆိုတဲ့ ကျောင်းသားလေးတစ်ယောက် ရှိပါတယ်။",
      },
      { sentence: "သူက ပန်းချီဆွဲတာ အရမ်းဝါသနာပါတဲ့ ကလေးပါ။" },
      {
        sentence:
          "တစ်နေ့တော့ သူ့ကျောင်းမှာ ပန်းချီပြိုင်ပွဲ ကျင်းပမယ်ဆိုတဲ့ သတင်းကြားတော့ မောင်မြတ်သူ အရမ်းပျော်သွားတယ်။",
      },
      {
        sentence:
          "ပြိုင်ပွဲမှာ ဆုရအောင် သူအရမ်းကြိုးစားပြင်ဆင်ခဲ့တယ်၊ နေ့တိုင်း ပုံဆွဲလေ့ကျင့်နေတာပေါ့။",
      },
    ],
    image: "/story/s2.png",
  },
  {
    id: 1,
    title : 'မောင်မြတ်သူ၏ ပန်းချီပြိုင်ပွဲ',
    sentences: [
      { sentence: "ပြိုင်ပွဲနေ့ ရောက်တော့ မောင်မြတ်သူ စိတ်လှုပ်ရှားနေတာပေါ့။" },
      {
        sentence:
          "ဒါပေမယ့် ကံဆိုးချင်တော့ ကျောင်းထဲဝင်လာတုန်း သူခြေချော်ပြီး လဲကျသွားတယ်။",
      },
      { sentence: "သူ့လက်မောင်း ထိခိုက်သွားတာ သိလိုက်ရတယ်။" },
      {
        sentence:
          "ကျောင်းက ဆရာဝန်က စစ်ကြည့်တော့ အရိုးကွဲသွားလို့ ပတ်တီးစည်းပေးရတယ်။",
      },
    ],
    image: "/story/s3.png",
  },
  {
    id:1,
    title : 'မောင်မြတ်သူ၏ ပန်းချီပြိုင်ပွဲ',

    sentences: [
      { sentence: "မောင်မြတ်သူ အရမ်းစိတ်ပျက်သွားတာပေါ့။" },
      {
        sentence:
          "သူ ဘယ်လောက်ပဲ ပြိုင်ပွဲဝင်ချင်နေပေမယ့် လက်ကျိုးနေတော့ ပုံမဆွဲနိုင်တော့ဘူးလေ။",
      },
      {
        sentence:
          "ဒါဟာ 'က ချင်လျက်လက်ကျိုး' ဆိုတဲ့ စကားပုံနဲ့ တူတယ်၊ လုပ်ချင်တာရှိပေမယ့် မလုပ်နိုင်တဲ့ အခြေအနေပေါ့။",
      },
      {
        sentence: "ဒီတော့ မောင်မြတ်သူရဲ့ မိဘတွေက သူ့ကို နှစ်သိမ့်ပြောဆိုကြတယ်။",
      },
    ],
    image: "/story/s6.png",
  },
  {
    id: 1,
    title : 'မောင်မြတ်သူ၏ ပန်းချီပြိုင်ပွဲ',

    sentences: [
      {
        sentence:
          "'သားရယ်... စိတ်မပျက်နဲ့။ နောက်ထပ် အခွင့်အရေးတွေ ရှိဦးမှာပါ' လို့ ပြောပြတယ်။",
      },
      {
        sentence: "မောင်မြတ်သူလည်း ဒီစကားကို နားထောင်ပြီး စိတ်ဓာတ်မကျတော့ဘူး။",
      },
      {
        sentence:
          "သူနားလည်လာတာက ဘဝမှာ မမျှော်လင့်ထားတဲ့ အခက်အခဲတွေ ကြုံရတတ်တယ်ဆိုတာပါ။",
      },
      {
        sentence:
          "ဒါပေမယ့် အဲဒီအခက်အခဲတွေကို ရင်ဆိုင်ပြီး ဆက်ကြိုးစားမယ်ဆိုရင် အောင်မြင်မှုရနိုင်တယ်ဆိုတာ သဘောပေါက်လာတယ်။",
      },
    ],
    image: "/story/s5.png",
  },
  {
    id: 1,
    title : 'မောင်မြတ်သူ၏ ပန်းချီပြိုင်ပွဲ',

    sentences: [
      {
        sentence:
          "နောက်ပိုင်း သူ့လက် ပြန်ကောင်းလာတော့ နောက်ထပ်ပြိုင်ပွဲတစ်ခုမှာ ဝင်ရောက်ယှဉ်ပြိုင်ခဲ့တယ်။",
      },
      { sentence: "အဲဒီပြိုင်ပွဲမှာ မောင်မြတ်သူ ပထမဆု ရခဲ့တယ်။" },
      { sentence: "သူ အရမ်းဝမ်းသာသွားတာပေါ့။" },
      {
        sentence:
          "ဒီပုံပြင်လေးကနေ မောင်မြတ်သူလို စိတ်ဓာတ်မကျဘဲ ကြိုးစားရင် အောင်မြင်နိုင်တယ်ဆိုတာ သင်ခန်းစာရခဲ့ပါတယ်။",
      },
    ],
    image: "/story/s7.png",
  },
];
