export type StorySegment = {
    id: number;
    sentences: string[];
    image: string;
  };

export const story : StorySegment[] = [
      {
        "id": 1,
        "sentences": [
          "တစ်ခါတုန်းက မောင်မြတ်သူဆိုတဲ့ ကျောင်းသားလေးတစ်ယောက် ရှိပါတယ်။",
          "သူက ပန်းချီဆွဲတာ အရမ်းဝါသနာပါတဲ့ ကလေးပါ။",
          "တစ်နေ့တော့ သူ့ကျောင်းမှာ ပန်းချီပြိုင်ပွဲ ကျင်းပမယ်ဆိုတဲ့ သတင်းကြားတော့ မောင်မြတ်သူ အရမ်းပျော်သွားတယ်။",
          "ပြိုင်ပွဲမှာ ဆုရအောင် သူအရမ်းကြိုးစားပြင်ဆင်ခဲ့တယ်၊ နေ့တိုင်း ပုံဆွဲလေ့ကျင့်နေတာပေါ့။"
        ],
        "image": "/story/s2.png"
      },
      {
        "id": 2,
        "sentences": [
          "ပြိုင်ပွဲနေ့ ရောက်တော့ မောင်မြတ်သူ စိတ်လှုပ်ရှားနေတာပေါ့။",
          "ဒါပေမယ့် ကံဆိုးချင်တော့ ကျောင်းထဲဝင်လာတုန်း သူခြေချော်ပြီး လဲကျသွားတယ်။",
          "သူ့လက်မောင်း ထိခိုက်သွားတာ သိလိုက်ရတယ်။",
          "ကျောင်းက ဆရာဝန်က စစ်ကြည့်တော့ အရိုးကွဲသွားလို့ ပတ်တီးစည်းပေးရတယ်။"
        ],
        "image": "/story/s3.png"
      },
      {
        "id": 3,
        "sentences": [
          "မောင်မြတ်သူ အရမ်းစိတ်ပျက်သွားတာပေါ့။",
          "သူ ဘယ်လောက်ပဲ ပြိုင်ပွဲဝင်ချင်နေပေမယ့် လက်ကျိုးနေတော့ ပုံမဆွဲနိုင်တော့ဘူးလေ။",
          "ဒါဟာ 'က ချင်လျက်လက်ကျိုး' ဆိုတဲ့ စကားပုံနဲ့ တူတယ်၊ လုပ်ချင်တာရှိပေမယ့် မလုပ်နိုင်တဲ့ အခြေအနေပေါ့။",
          "ဒီတော့ မောင်မြတ်သူရဲ့ မိဘတွေက သူ့ကို နှစ်သိမ့်ပြောဆိုကြတယ်။"
        ],
        "image": "/story/s6.png"
      },
      {
        "id": 4,
        "sentences": [
          "'သားရယ်... စိတ်မပျက်နဲ့။ နောက်ထပ် အခွင့်အရေးတွေ ရှိဦးမှာပါ' လို့ ပြောပြတယ်။",
          "မောင်မြတ်သူလည်း ဒီစကားကို နားထောင်ပြီး စိတ်ဓာတ်မကျတော့ဘူး။",
          "သူနားလည်လာတာက ဘဝမှာ မမျှော်လင့်ထားတဲ့ အခက်အခဲတွေ ကြုံရတတ်တယ်ဆိုတာပါ။",
          "ဒါပေမယ့် အဲဒီအခက်အခဲတွေကို ရင်ဆိုင်ပြီး ဆက်ကြိုးစားမယ်ဆိုရင် အောင်မြင်မှုရနိုင်တယ်ဆိုတာ သဘောပေါက်လာတယ်။"
        ],
        "image": "/story/s5.png"
      },
      {
        "id": 5,
        "sentences": [
          "နောက်ပိုင်း သူ့လက် ပြန်ကောင်းလာတော့ နောက်ထပ်ပြိုင်ပွဲတစ်ခုမှာ ဝင်ရောက်ယှဉ်ပြိုင်ခဲ့တယ်။",
          "အဲဒီပြိုင်ပွဲမှာ မောင်မြတ်သူ ပထမဆု ရခဲ့တယ်။",
          "သူ အရမ်းဝမ်းသာသွားတာပေါ့။",
          "ဒီပုံပြင်လေးကနေ မောင်မြတ်သူလို စိတ်ဓာတ်မကျဘဲ ကြိုးစားရင် အောင်မြင်နိုင်တယ်ဆိုတာ သင်ခန်းစာရခဲ့ပါတယ်။"
        ],
        "image": "/story/s7.png"
      }
    ]